tutorials/channel3D_shear300/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// internalField from file
#include "U_IC.dat"

//internalField   uniform (0 0 0);

boundaryField
{
    #include "$FOAM_CASE/constant/inputParameters"
    inletVessel 
    {
        type                flowRateInletVelocity;
        volumetricFlowRate  $inletFlowRate; 
        extrapolateProfile  yes;
        value               uniform (0 0 0);
    }
    
    outletVessel
    {
        type                zeroGradient;
    }
    
    fixedWalls
    {
        type            noSlip;
    }
    
    injuryWalls
    {
        type            noSlip;
    }
}

// ************************************************************************* //
